app/controllers/audit_logs_controller.rb

  def index
    @audit_logs = AuditLog.page(params[:page]).per(10)
---
SELECT  "audit_logs".* FROM "audit_logs" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "audit_logs"

def confirm
  audit_log = AuditLog.find(params[:id])
---
SELECT  "audit_logs".* FROM "audit_logs" WHERE "audit_logs"."id" = $1 LIMIT 1  [["id", 1]]