app/controllers/posts_controller.rb

	def index
		@posts = Post.posts_by(current_user).page(params[:page]).per(10)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 LIMIT 10 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]

	def create
		@post = Post.new(post_params)
		@post.user_id = current_user.id

		if @post.save
---
INSERT INTO "posts" ("date", "rationale", "overtime_request", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2017-01-18"], ["rationale", "asdfasdf"], ["overtime_request", "3.0"], ["user_id", 1], ["created_at", "2017-01-05 19:11:03.676107"], ["updated_at", "2017-01-05 19:11:03.676107"]]

	def update
		authorize @post

		if @post.update(post_params)
---
UPDATE "posts" SET "rationale" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["rationale", "asdfsadf"], ["updated_at", "2016-12-22 21:58:03.938087"], ["id", 1]]

	def destroy
    @post.delete
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]